#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/shuuren/shuuren-alpha/runs/run-j42NxAscYN3TVxcF

Waiting for the plan to start...

Terraform v1.3.1
on linux_amd64
Initializing plugins and modules...
data.archive_file.signup: Reading...
data.archive_file.api_character_file: Reading...
data.archive_file.api_character_file: Read complete after 0s [id=b5b1ca989c3cfe4b3251f17b07aba6091a25f2f9]
data.archive_file.signup: Read complete after 0s [id=6c21b48943481d4f6cb249fab0eaaad0281afe57]
aws_iam_role.signup_event_role: Refreshing state... [id=signup_event_role]
aws_api_gateway_rest_api.shuuren_api_gateway_rest_api: Refreshing state... [id=kvf6m5r20e]
aws_dynamodb_table.character: Refreshing state... [id=character]
aws_iam_policy.api_character_policy: Refreshing state... [id=arn:aws:iam::265390238424:policy/api_character_policy]
aws_iam_role.api_character_role: Refreshing state... [id=api_character_role]
aws_acm_certificate.shuuren_cert: Refreshing state... [id=arn:aws:acm:us-east-1:265390238424:certificate/adf4603e-1f50-4653-b239-ade0bcb8362d]
aws_iam_policy.signup_event_policy: Refreshing state... [id=arn:aws:iam::265390238424:policy/signup_event_policy]
aws_api_gateway_resource.shuuren_api_user: Refreshing state... [id=pbfffe]
aws_api_gateway_deployment.shuuren_api_deployment: Refreshing state... [id=1ut6ce]
aws_api_gateway_resource.api_character_resource: Refreshing state... [id=gysnn4]
aws_api_gateway_rest_api_policy.shuuren_api_policy: Refreshing state... [id=kvf6m5r20e]
aws_api_gateway_method.shuuren_api_user_get: Refreshing state... [id=agm-kvf6m5r20e-pbfffe-GET]
aws_api_gateway_method.api_character_method: Refreshing state... [id=agm-kvf6m5r20e-gysnn4-ANY]
aws_api_gateway_stage.shuuren_api_stage: Refreshing state... [id=ags-kvf6m5r20e-api]
aws_api_gateway_integration.shuuren_api_user_get_integration: Refreshing state... [id=agi-kvf6m5r20e-pbfffe-GET]
aws_acm_certificate_validation.shuuren_cert_validation: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
aws_api_gateway_domain_name.shuuren_api_gateway_custom_domain: Refreshing state... [id=api.shuuren.com]
aws_api_gateway_base_path_mapping.shuuren_api_mapping: Refreshing state... [id=api.shuuren.com/]
aws_iam_role_policy_attachment.signup_event_policy_attachment: Refreshing state... [id=signup_event_role-20221007045500101300000001]
aws_lambda_function.signup_post_confirmation: Refreshing state... [id=signup_post_confirmation]
aws_iam_role_policy_attachment.api_character_policy_attachment: Refreshing state... [id=api_character_role-20221030190908654500000001]
aws_lambda_function.api_character_function: Refreshing state... [id=character]
aws_lambda_permission.api_character_permission: Refreshing state... [id=APICharacterPermission]
aws_api_gateway_integration.api_character_integration: Refreshing state... [id=agi-kvf6m5r20e-gysnn4-ANY]
aws_cognito_user_pool.shuuren_user_pool: Refreshing state... [id=us-east-1_KFBySRRrW]
aws_cognito_user_pool_domain.shuuren_auth_domain: Refreshing state... [id=auth.shuuren.com]
aws_lambda_permission.allow_cognito_post_confirmation: Refreshing state... [id=AllowExecutionFromCognito]
aws_cognito_user_pool_client.shuuren_client: Refreshing state... [id=5t6dfe58g76h8vkmcfvb2o6keu]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_api_gateway_deployment.shuuren_api_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "shuuren_api_deployment" {
      ~ created_date  = "2022-10-30T19:57:49Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-east-1:265390238424:kvf6m5r20e/" -> (known after apply)
      ~ id            = "1ut6ce" -> (known after apply)
      ~ invoke_url    = "https://kvf6m5r20e.execute-api.us-east-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          ~ "redeployment" = "5de754d92170f1a983d78e1792673def303afbeb" -> "a7cdcdf405566b96659025dde922a492ac9ed6ea"
        }
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_stage.shuuren_api_stage will be updated in-place
  ~ resource "aws_api_gateway_stage" "shuuren_api_stage" {
      ~ deployment_id         = "1ut6ce" -> (known after apply)
        id                    = "ags-kvf6m5r20e-api"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # aws_lambda_function.api_character_function will be updated in-place
  ~ resource "aws_lambda_function" "api_character_function" {
        id                             = "character"
      ~ last_modified                  = "2022-10-30T20:00:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "nmVHS28nWi+gaI1mc2QidKhbVvMRMskYS6JRh5MMKb8=" -> "02VRbAp3y4+DHuv+Fv7CJN0ow7oRLoRWM5TsjOc/qx0="
        tags                           = {}
        # (19 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.


```
</details>
*Pushed by: @rise-sudo, Action: `pull_request`*